app/controllers/home_controller.rb

INSERT INTO "users" ("data", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"
SELECT "users".* FROM "users"
---
  def index
    begin
      source = 'https://randomuser.me/api'
      resp = Net::HTTP.get_response(URI.parse(source))
      data = resp.body
      @result = JSON.parse(data)
      User.create(data: @result["results"][0])

      users = User.all